БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ВедомостьУчетаАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ВедомостьУчетаАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьУчетаАкадемическихЗадолженностей.Дата,
	|	ВедомостьУчетаАкадемическихЗадолженностей.Дисциплина,
	|	ВедомостьУчетаАкадемическихЗадолженностей.НаименованиеКонтроля,
	|	ВедомостьУчетаАкадемическихЗадолженностей.Номер,
	|	ВедомостьУчетаАкадемическихЗадолженностей.Оценка,
	|	ВедомостьУчетаАкадемическихЗадолженностей.Преподаватель,
	|	ВедомостьУчетаАкадемическихЗадолженностей.СтатусАкадемическойЗадолженности,
	|	ВедомостьУчетаАкадемическихЗадолженностей.Студент
	|ИЗ
	|	Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК ВедомостьУчетаАкадемическихЗадолженностей
	|ГДЕ
	|	ВедомостьУчетаАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
